# Make sure you have following env variables
# when using this Brewfile or use it with modules/brew.bash
#
#  HOMEBREW_CASK_OPTS="--appdir=/Applications"
#  RBENV_ROOT=/usr/local/var/rbenv
#  NVM_DIR=/usr/local/var/nvm

# Essential terminal utilities
tap "homebrew/services"

brew "openssl"
brew "readline", link: true
brew "git"
brew "postgresql"
brew "zplug"
brew "zsh"

# Essential Mac applications
tap "caskroom/cask"
tap "caskroom/versions"

cask "java"
cask "google-chrome"
cask "slack"
cask "1password"
cask "postgres"
cask "vlc"
cask "outline"
cask "outline-manager"

# Node version manager
brew "nvm"
brew "yarn"

# Ruby
brew "rbenv"
brew "rbenv-default-gems"
